<< PASS password
<< NICK user
<< USER user user localhost :user
>> :server 001 <nick> :Welcome to the <network> Network, <nick>!<user>@<host>
<< MODE <nick> +i
<< WHOIS user
>> 230 PASS :Password correct
>> 421 'MODE' :Unknown command
>> 421 'WHOIS' :Unknown command
<< PING server
>> PONG
--> lag pong
<< NICK nick1
<< JOIN #test
<< PRIVMSG #test :hello world
>> :nick2!user@user PRIVMSG #test :good bye
>> :nick3!user@user PRIVMSG #test :nice
<< QUIT :leaving
