<< PASS password
<< NICK user
<< USER user user localhost :user
>> :server 001 <nick> :Welcome to the <network> Network, <nick>!<user>@<host>
<< MODE <nick> +i
<< WHOIS user
>> 230 PASS :Password correct
>> 421 'MODE' :Unknown command
>> 421 'WHOIS' :Unknown command
<< PING server
>> PONG
--> lag pong
<< NICK nick3
<< PING server
>> PONG
--> FAILED whois
--> lag pong
<< PING server
>> PONG
--> lag pong
<< PING server
>> PONG
--> lag pong
<< PING server
>> PONG
--> lag pong
<< PING server
>> PONG
--> lag pong
<< JOIN #test
>> :nick1!user@user PRIVMSG #test :hello 2
<< PRIVMSG #test :3
<< PING server
>> PONG
--> lag pong
<< QUIT :leaving
